<a href="https://colab.research.google.com/github/satk66/por/blob/master/csv.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
path='/content/sample_data/'

In [3]:
import pandas as pd
pd.read_csv(path+'california_housing_train.csv')

       longitude  latitude  ...  median_income  median_house_value
0        -114.31     34.19  ...         1.4936             66900.0
1        -114.47     34.40  ...         1.8200             80100.0
2        -114.56     33.69  ...         1.6509             85700.0
3        -114.57     33.64  ...         3.1917             73400.0
4        -114.57     33.57  ...         1.9250             65500.0
...          ...       ...  ...            ...                 ...
16995    -124.26     40.58  ...         2.3571            111400.0
16996    -124.27     40.69  ...         2.5179             79000.0
16997    -124.30     41.84  ...         3.0313            103600.0
16998    -124.30     41.80  ...         1.9797             85800.0
16999    -124.35     40.54  ...         3.0147             94600.0

[17000 rows x 9 columns]

국가보훈처 보훈의료 위탁병원 코로나-19 병원 정보
보훈대상자 의료 제공 위탁병원의 코로나-19 관련 병원 운영 현황 정보 등 제공 (국민안심병원, 감염병전담기관, 감염병전담기관 외래진료 정보) (제공주기) 코로나-19 관련 병원 운영 현황 변경 시 일자별 제공 (제공방법) 공공데이터 표준 포멧(CSV 파일) 형식 제공 (제공항목) 시군구, 의료기관명, 진료과수, 병상수, 전화번호, 주소, 국민안심병원 여부, 감염병전담기관 여부, 감염병전담기관 외래진료 가능여부 * 여부는 Y/N 표시

In [7]:
data_path='/content/drive/My Drive/파이썬/covid.csv'
df2=pd.read_csv(data_path, encoding='cp949')
df2

            시군구       의료기관명  진료과수  ...  국민안심병원 여부 감염병전담기관 여부 감염병전담기관 외래진료 가능여부
0       강원도 강릉시      강릉동인병원    21  ...        NaN        NaN               NaN
1       강원도 강릉시     박정빈외과의원     1  ...        NaN        NaN               NaN
2       강원도 강릉시     이명호내과의원     1  ...        NaN        NaN               NaN
3       강원도 고성군       세브란의원     4  ...        NaN        NaN               NaN
4       강원도 동해시  근로복지공단동해병원    10  ...          Y        NaN               NaN
..          ...         ...   ...  ...        ...        ...               ...
314  충북 청주시 청원구      초정노인병원     3  ...        NaN        NaN               NaN
315  충북 청주시 흥덕구      청주현대병원     4  ...        NaN        NaN               NaN
316      충북 충주시     건국대충주병원    23  ...          Y        NaN               NaN
317      충북 충주시      송원요양병원     2  ...        NaN        NaN               NaN
318      충북 충주시   충주시노인전문병원     4  ...        NaN        NaN               NaN

[319 rows x 9 columns]

In [0]:
man =[[1,2,3],[1,2,3],[1,2,3]]

In [10]:
pd.DataFrame(man)

   0  1  2
0  1  2  3
1  1  2  3
2  1  2  3

In [0]:
df3=pd.DataFrame(man)

In [13]:
df3.index=['a','b','c']
df3.columns=['1차','2차','3차']
df3

   1차  2차  3차
a   1   2   3
b   1   2   3
c   1   2   3

In [14]:
df3['1차']==3

a    False
b    False
c    False
Name: 1차, dtype: bool

In [15]:
df4=df3['1차','2차']
df4

a    1
b    1
c    1
Name: 1차, dtype: int64

In [16]:
df4

a    1
b    1
c    1
Name: 1차, dtype: int64

In [0]:
jumsu=[100,75,67,45,80]
for i, val in enumerate :
  if val>=60:
    print("d% 번 학생은 합격입니다",val[i+1])

In [0]:
aoa =[[1,2,3,4,5],[1,2,3,4,5],[1,2,3,4,5]]

In [21]:
pd.DataFrame(aoa)

   0  1  2  3  4
0  1  2  3  4  5
1  1  2  3  4  5
2  1  2  3  4  5

In [0]:
dio=pd.DataFrame(aoa)

In [25]:
dio.columns=['1차','2차','3차','4차','5차']
dio

   1차  2차  3차  4차  5차
0   1   2   3   4   5
1   1   2   3   4   5
2   1   2   3   4   5